brew 'git'

# dev env
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'nvim'

# fuzzy search
brew 'ripgrep'
brew 'fzf'

# window manager
tap 'koekeishiya/formulae'
brew 'chunkwm'
brew 'khd'

# tech
brew 'node'
brew 'go'
brew 'elixir'
brew 'python3'
brew 'mysql'
brew 'kubernetes-cli'

# util
brew 'tree'
brew 'htop'
brew 'jq'

# customize spotify
brew khanhas/tap/spicetify-cli

# openssl needs linking on MacOS for gcc complier
# cd /usr/local/include
# ln -s ../opt/openssl/include/openssl/ .
brew 'openssl'

tap 'instrumenta/instrumenta'
brew 'kubeval'

cask 'google-cloud-sdk'
cask 'docker'
cask 'minikube'
