brew "git"

# dev env
brew "tmux"
brew "reattach-to-user-namespace"
brew "nvim"

# fuzzy search
brew "ripgrep"
brew "fzf"

# window manager
tap "koekeishiya/formulae"
brew "chunkwm"
brew "khd"

# tech
brew "node"
brew "go"
brew "elixir"
brew "python3"
brew "mysql"

# util
brew "tree"
brew "htop"
